Hi @eabrouwer3,

sorry but I didn't manage to check the provider on Friday. 

I'm still running Airbyte on v0.40.14 (upgrading Airbyte requires some testing for other sync jobs) but with your provider in version 0.1.17 I'm able to set the cron job for my existing connection!
Thank you very much!

Just in case you're interested in the thing I mentioned about API changes on [Airbyte v0.40.15](https://github.com/airbytehq/airbyte/commit/ec5496840df4b0af93afa341d820268d0212c7e9).

This is the error I get when I try to create a new source on Airbyte v0.40.14 and provider 0.1.17:
```
Terraform will perform the following actions:

  # airbyte_source.salesforce_2 will be created
  + resource "airbyte_source" "salesforce_2" {
      + connection_configuration = (sensitive value)
      + definition_id            = "b117307c-anon-anon-anon-947e34922962"
      + definition_name          = (known after apply)
      + icon                     = (known after apply)
      + id                       = (known after apply)
      + name                     = "Salesforce 2"
      + workspace_id             = "0335c7da-anon-anon-anon-8b969335895f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

airbyte_source.salesforce_2: Creating...
╷
│ Error: Error creating Source
│ 
│   with airbyte_source.salesforce_2,
│   on conf_source.tf line 20, in resource "airbyte_source" "salesforce_2":
│   20: resource "airbyte_source" "salesforce_2" {
│ 
│ Could not create Source, unexpected error: url: https://airbyte.host/api/v1/scheduler/sources/check_connection, status: 422, body:
│ {"message":"Invalid json input. Unrecognized field \"workspaceId\" (class io.airbyte.api.model.generated.SourceCoreConfig), not marked as ignorable (2 known properties:
│ \"connectionConfiguration\", \"sourceDefinitionId\"])\n at [Source: (org.glassfish.jersey.message.internal.ReaderInterceptorExecutor$UnCloseableInputStream); line: 1,
│ column: 77] (through reference chain: io.airbyte.api.model.generated.SourceCoreConfig[\"workspaceId\"]) Unrecognized field \"workspaceId\" (class
│ io.airbyte.api.model.generated.SourceCoreConfig), not marked as ignorable","validationErrors":null}
```


